tests/ljast_hllc/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "1e-07/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

14
(
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          110982;
        startFace       165040;
    }
    cylindersRow1
    {
        type            patch;
        nFaces          186;
        startFace       276022;
    }
    cylindersRow2
    {
        type            patch;
        nFaces          186;
        startFace       276208;
    }
    cylindersRow3
    {
        type            patch;
        nFaces          186;
        startFace       276394;
    }
    cylindersRow4
    {
        type            patch;
        nFaces          186;
        startFace       276580;
    }
    cylindersRow5
    {
        type            patch;
        nFaces          186;
        startFace       276766;
    }
    cylindersRow6
    {
        type            patch;
        nFaces          186;
        startFace       276952;
    }
    cylindersRow7
    {
        type            patch;
        nFaces          186;
        startFace       277138;
    }
    cylindersRow8
    {
        type            patch;
        nFaces          186;
        startFace       277324;
    }
    empty_top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          110982;
        startFace       277510;
    }
    walls
    {
        type            patch;
        nFaces          1120;
        startFace       388492;
    }
    inlet
    {
        type            patch;
        nFaces          89;
        startFace       389612;
    }
    outlet
    {
        type            patch;
        nFaces          89;
        startFace       389701;
    }
    openBoundary
    {
        type            patch;
        nFaces          80;
        startFace       389790;
    }
)

// ************************************************************************* //
