tests/ljast_hllc/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialConstants;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

p0              p0 [1 -1 -2 0 0 0 0] 17500;
T0              T0 [0 0 0 1 0 0 0] 298.15;

EOS_m0          0; //0 = perfect gas, 1 = liquid

psi_m0          psi_m0 [0 -2 2 0 0 0 0] 0;

beta_m0         beta_m0 [1 -3 0 -1 0 0 0] 0;

R_m0            R_m0 [0 2 -2 -1 0 0 0] 287.0856;

Cv_m0           Cv_m0 [0 2 -2 -1 0 0 0] 717.857;

Cp_m0           Cp_m0 [0 2 -2 -1 0 0 0] 1005;

rho0_m0         rho0_m0 [1 -3 0 0 0 0 0] 0.20445;


// ************************************************************************* //
