tests/ljast_hllc/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
110982
(
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
(828.13 0 0)
...
)
;

boundaryField
{
    empty
    {
        type            empty;
    }
    cylindersRow1
    {
        type            noSlip;
    }
    cylindersRow2
    {
        type            noSlip;
    }
    cylindersRow3
    {
        type            noSlip;
    }
    cylindersRow4
    {
        type            noSlip;
    }
    cylindersRow5
    {
        type            noSlip;
    }
    cylindersRow6
    {
        type            noSlip;
    }
    cylindersRow7
    {
        type            noSlip;
    }
    cylindersRow8
    {
        type            noSlip;
    }
    empty_top
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (828.13 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    openBoundary
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
