tests/ljast_hllc/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
110982
(
205051
205051
205051
205051
205051
205051
205051
205051
...
)
;

boundaryField
{
    empty
    {
        type            empty;
    }
    cylindersRow1
    {
        type            zeroGradient;
    }
    cylindersRow2
    {
        type            zeroGradient;
    }
    cylindersRow3
    {
        type            zeroGradient;
    }
    cylindersRow4
    {
        type            zeroGradient;
    }
    cylindersRow5
    {
        type            zeroGradient;
    }
    cylindersRow6
    {
        type            zeroGradient;
    }
    cylindersRow7
    {
        type            zeroGradient;
    }
    cylindersRow8
    {
        type            zeroGradient;
    }
    empty_top
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 17500;
    }
    openBoundary
    {
        type            fixedValue;
        value           uniform 17500;
    }
}


// ************************************************************************* //
