tests/ljast_hllc/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
);

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        

        fieldMask
        #{
            mag(pos()) < 0.44
            
        #};

        expression
        #{
            //5* 1000/0.4 * vector(pos().x(), 0 , 0 )

            5000 * vector(pos().x(),0,0) / 0.4
        #};
    }
);

    

// ************************************************************************* //
