tests/ljast_hllc/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    
    volScalarFieldValue p  17500
    volScalarFieldValue rho 0.20445
    volScalarFieldValue rho_m0 0.20445
    volVectorFieldValue U (0. 0. 0.)
    volScalarFieldValue T 298.15
);

regions
(
    boxToCell
    {
        box (-0.30 -0.1 -1) (0.022 0.1 1);
        fieldValues
        (
            volScalarFieldValue p 205051
            volScalarFieldValue rho 0.81
            volScalarFieldValue rho_m0 0.81
            volVectorFieldValue U (828.13 0. 0.)
            volScalarFieldValue T 881.79
        );
    }
);


// ************************************************************************* //   
