tests/ljast_hllc/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
{
    // Mandatory (inherited) entries
    name        openBoundary;
    type        faceSet;
    action      new;

    // Mandatory entries
    source      boxToFace;

    // Conditional mandatory entries
    // Select either of the below

    // Option-1
    boxes
    (
        (0.26 -0.06 -0.01) (0.31 -0.043 0.01) // box-1
        (0.26 0.0459 -0.01) (0.31 0.06  0.01) // box-2
        
    );

    
}

);

